{
  "total_distinct": 692,
  "total_occurrences": 1745,
  "tokens": {
    "往": 25,
    "得": 24,
    "人": 19,
    "來": 17,
    "終": 16,
    "君子": 16,
    "大": 15,
    "子": 14,
    "見": 14,
    "王": 13,
    "日": 13,
    "孚": 13,
    "行": 12,
    "遇": 12,
    "出": 11,
    "食": 11,
    "克": 10,
    "在": 10,
    "言": 10,
    "小人": 10,
    "我": 10,
    "小": 10,
    "自": 9,
    "黃": 8,
    "輿": 8,
    "疾": 8,
    "入": 8,
    "天": 8,
    "喪": 8,
    "寇": 8,
    "婦": 8,
    "夫": 8,
    "命": 7,
    "家": 7,
    "壯": 7,
    "心": 7,
    "包": 7,
    "朋": 7,
    "復": 7,
    "能": 7,
    "牛": 7,
    "至": 6,
    "從": 6,
    "譽": 6,
    "血": 6,
    "國": 6,
    "中": 6,
    "鄰": 6,
    "馬": 6,
    "獲": 6,
    "后": 6,
    "逐": 6,
    "事": 6,
    "公": 6,
    "趾": 6,
    "居": 6,
    "大人": 6,
    "濡": 6,
    "號": 6,
    "系": 6,
    "說": 6,
    "鴻漸": 6,
    "方": 5,
    "龍": 5,
    "中行": 5,
    "災": 5,
    "眚": 5,
    "年": 5,
    "次": 5,
    "田": 5,
    "涉": 5,
    "明夷": 5,
    "首": 5,
    "亡": 5,
    "尚": 5,
    "恤": 5,
    "歸妹": 5,
    "婚媾": 5,
    "視": 5,
    "且": 5,
    "女": 5,
    "羊": 5,
    "過": 5,
    "雨": 5,
    "歲": 5,
    "德": 5,
    "失": 5,
    "尾": 5,
    "何": 5,
    "金": 5,
    "生": 5,
    "膚": 5,
    "牀": 5,
    "童": 5,
    "噬": 5,
    "先": 5,
    "師": 4,
    "征": 4,
    "禽": 4,
    "承": 4,
    "既": 4,
    "大川": 4,
    "鳴": 4,
    "富": 4,
    "伐": 4,
    "邑": 4,
    "飛": 4,
    "主": 4,
    "門": 4,
    "福": 4,
    "笑": 4,
    "躬": 4,
    "高": 4,
    "臣": 4,
    "即": 4,
    "酒": 4,
    "嗟": 4,
    "交": 4,
    "車": 4,
    "喜": 4,
    "虎": 4,
    "滅": 4,
    "莫": 4,
    "幹": 4,
    "父": 4,
    "无妄": 4,
    "同人": 4,
    "履": 3,
    "章": 3,
    "成": 3,
    "敦": 3,
    "君": 3,
    "否": 3,
    "左": 3,
    "執": 3,
    "大君": 3,
    "夷": 3,
    "拯": 3,
    "庭": 3,
    "明": 3,
    "初": 3,
    "禴": 3,
    "茅": 3,
    "戒": 3,
    "帝": 3,
    "告": 3,
    "介": 3,
    "恆": 3,
    "渝": 3,
    "陵": 3,
    "遂": 3,
    "泥": 3,
    "矢": 3,
    "維": 3,
    "射": 3,
    "娣": 3,
    "幽": 3,
    "反": 3,
    "歸": 3,
    "月": 3,
    "幾": 3,
    "望": 3,
    "實": 3,
    "鳥": 3,
    "西": 3,
    "郊": 3,
    "取": 3,
    "穴": 3,
    "蔀": 3,
    "折": 3,
    "戶": 3,
    "藩": 3,
    "羸": 3,
    "角": 3,
    "退": 3,
    "艱": 3,
    "缶": 3,
    "邑人": 3,
    "乘馬": 3,
    "班": 3,
    "舍": 3,
    "求": 3,
    "曳": 3,
    "宗": 3,
    "鬼": 3,
    "受": 3,
    "道": 3,
    "嘉": 3,
    "臀": 3,
    "妻": 3,
    "徐": 3,
    "爾": 3,
    "白": 3,
    "勝": 3,
    "惕": 3,
    "陸": 3,
    "魚": 3,
    "龜": 3,
    "顛": 3,
    "拂": 3,
    "丘": 3,
    "益": 3,
    "永": 3,
    "豕": 3,
    "耳": 3,
    "載": 3,
    "所": 3,
    "資": 3,
    "焚": 3,
    "習": 2,
    "王事": 2,
    "含": 2,
    "休": 2,
    "頻": 2,
    "獨": 2,
    "錫": 2,
    "尸": 2,
    "咸": 2,
    "甘": 2,
    "股": 2,
    "登": 2,
    "允": 2,
    "山": 2,
    "冥": 2,
    "拔": 2,
    "茹": 2,
    "彙": 2,
    "平": 2,
    "翩": 2,
    "乙": 2,
    "祉": 2,
    "石": 2,
    "遲": 2,
    "由": 2,
    "疑": 2,
    "死": 2,
    "虩": 2,
    "啞": 2,
    "億": 2,
    "蘇": 2,
    "索": 2,
    "矍": 2,
    "負": 2,
    "乘": 2,
    "致": 2,
    "拇": 2,
    "斯": 2,
    "墉": 2,
    "跛": 2,
    "眇": 2,
    "須": 2,
    "袂": 2,
    "良": 2,
    "士": 2,
    "離": 2,
    "是": 2,
    "斗": 2,
    "發": 2,
    "窺": 2,
    "羞": 2,
    "罔": 2,
    "羝": 2,
    "觸": 2,
    "輹": 2,
    "易": 2,
    "盈": 2,
    "它": 2,
    "前": 2,
    "磐": 2,
    "侯": 2,
    "字": 2,
    "虞": 2,
    "膏": 2,
    "泣": 2,
    "窞": 2,
    "險": 2,
    "納": 2,
    "安": 2,
    "碩": 2,
    "輪": 2,
    "祭": 2,
    "舊": 2,
    "谷": 2,
    "敬": 2,
    "引": 2,
    "涕": 2,
    "丈": 2,
    "木": 2,
    "紱": 2,
    "祀": 2,
    "宮": 2,
    "劓": 2,
    "和": 2,
    "未": 2,
    "腓": 2,
    "隨": 2,
    "憧": 2,
    "思": 2,
    "輔": 2,
    "變": 2,
    "枯": 2,
    "楊": 2,
    "老": 2,
    "棟": 2,
    "戎": 2,
    "牽": 2,
    "足": 2,
    "蔑": 2,
    "經": 2,
    "眈": 2,
    "擊": 2,
    "禦": 2,
    "已": 2,
    "遄": 2,
    "違": 2,
    "快": 2,
    "翰": 2,
    "戔": 2,
    "考": 2,
    "母": 2,
    "裕": 2,
    "閑": 2,
    "校": 2,
    "肉": 2,
    "乾": 2,
    "光": 2,
    "飲": 2,
    "孤": 2,
    "厥": 2,
    "弧": 2,
    "瑣": 2,
    "僕": 2,
    "處": 2,
    "斧": 2,
    "雉": 2,
    "鼓": 2,
    "歌": 2,
    "妾": 2,
    "革": 2,
    "鉉": 2,
    "威": 2,
    "進": 2,
    "賓": 2,
    "惠": 2,
    "去": 2,
    "好": 2,
    "攣": 2,
    "衎": 2,
    "孕": 2,
    "嗃": 2,
    "嘻": 2,
    "武": 2,
    "下": 2,
    "庚": 2,
    "坦": 2,
    "愬": 2,
    "霜": 1,
    "堅": 1,
    "冰": 1,
    "直": 1,
    "括": 1,
    "囊": 1,
    "裳": 1,
    "戰": 1,
    "野": 1,
    "玄": 1,
    "遠": 1,
    "袛": 1,
    "迷": 1,
    "敗": 1,
    "律": 1,
    "臧": 1,
    "長": 1,
    "帥": 1,
    "弟": 1,
    "開": 1,
    "憂": 1,
    "知": 1,
    "宜": 1,
    "勞": 1,
    "撝": 1,
    "侵": 1,
    "垂": 1,
    "翼": 1,
    "南": 1,
    "狩": 1,
    "腹": 1,
    "箕": 1,
    "晦": 1,
    "地": 1,
    "虛": 1,
    "岐": 1,
    "階": 1,
    "息": 1,
    "荒": 1,
    "馮": 1,
    "河": 1,
    "遐": 1,
    "遺": 1,
    "陂": 1,
    "城": 1,
    "隍": 1,
    "盱": 1,
    "盍": 1,
    "簪": 1,
    "貝": 1,
    "躋": 1,
    "狐": 1,
    "隼": 1,
    "上": 1,
    "愆": 1,
    "期": 1,
    "時": 1,
    "筐": 1,
    "刲": 1,
    "祖": 1,
    "妣": 1,
    "及": 1,
    "防": 1,
    "戕": 1,
    "必": 1,
    "密": 1,
    "云": 1,
    "弋": 1,
    "彼": 1,
    "謂": 1,
    "配": 1,
    "雖": 1,
    "旬": 1,
    "沛": 1,
    "沫": 1,
    "右": 1,
    "肱": 1,
    "慶": 1,
    "屋": 1,
    "闃": 1,
    "觌": 1,
    "浚": 1,
    "振": 1,
    "決": 1,
    "內": 1,
    "外": 1,
    "顯": 1,
    "驅": 1,
    "誡": 1,
    "桓": 1,
    "建": 1,
    "邅": 1,
    "鹿": 1,
    "惟": 1,
    "林": 1,
    "漣": 1,
    "枕": 1,
    "樽": 1,
    "簋": 1,
    "貳": 1,
    "約": 1,
    "牖": 1,
    "祗": 1,
    "係": 1,
    "徽": 1,
    "纆": 1,
    "寘": 1,
    "叢": 1,
    "棘": 1,
    "苦": 1,
    "故": 1,
    "連": 1,
    "茀": 1,
    "繻": 1,
    "衣": 1,
    "袽": 1,
    "東": 1,
    "殺": 1,
    "鮒": 1,
    "瓮": 1,
    "敝": 1,
    "漏": 1,
    "渫": 1,
    "惻": 1,
    "汲": 1,
    "并": 1,
    "甃": 1,
    "冽": 1,
    "寒": 1,
    "泉": 1,
    "收": 1,
    "幕": 1,
    "沙": 1,
    "速": 1,
    "客": 1,
    "亂": 1,
    "握": 1,
    "位": 1,
    "齎": 1,
    "咨": 1,
    "洟": 1,
    "官": 1,
    "功": 1,
    "拘": 1,
    "株": 1,
    "覿": 1,
    "朱": 1,
    "據": 1,
    "蒺": 1,
    "藜": 1,
    "刖": 1,
    "赤": 1,
    "葛": 1,
    "藟": 1,
    "臲": 1,
    "卼": 1,
    "動": 1,
    "商": 1,
    "寧": 1,
    "剝": 1,
    "脢": 1,
    "頰": 1,
    "舌": 1,
    "鞏": 1,
    "己": 1,
    "就": 1,
    "改": 1,
    "占": 1,
    "豹": 1,
    "面": 1,
    "藉": 1,
    "稊": 1,
    "橈": 1,
    "隆": 1,
    "華": 1,
    "頂": 1,
    "夜": 1,
    "頄": 1,
    "慍": 1,
    "聞": 1,
    "信": 1,
    "莧": 1,
    "辨": 1,
    "貫": 1,
    "寵": 1,
    "果": 1,
    "廬": 1,
    "靈": 1,
    "觀": 1,
    "朵": 1,
    "欲": 1,
    "桎梏": 1,
    "刑": 1,
    "金夫": 1,
    "困": 1,
    "酌": 1,
    "友": 1,
    "使": 1,
    "限": 1,
    "列": 1,
    "夤": 1,
    "薰": 1,
    "身": 1,
    "序": 1,
    "徒": 1,
    "皤": 1,
    "於": 1,
    "園": 1,
    "束": 1,
    "帛": 1,
    "衛": 1,
    "牿": 1,
    "豶": 1,
    "牙": 1,
    "衢": 1,
    "摧": 1,
    "愁": 1,
    "茲": 1,
    "眾": 1,
    "鼫": 1,
    "鼠": 1,
    "屨": 1,
    "鼻": 1,
    "臘": 1,
    "毒": 1,
    "胏": 1,
    "震": 1,
    "賞": 1,
    "惡": 1,
    "巷": 1,
    "掣": 1,
    "涂": 1,
    "張": 1,
    "懷": 1,
    "巢": 1,
    "咷": 1,
    "錯": 1,
    "然": 1,
    "昃": 1,
    "耋": 1,
    "突": 1,
    "棄": 1,
    "沱": 1,
    "戚": 1,
    "醜": 1,
    "仇": 1,
    "塞": 1,
    "虧": 1,
    "覆": 1,
    "餗": 1,
    "形": 1,
    "渥": 1,
    "玉": 1,
    "害": 1,
    "彭": 1,
    "佑": 1,
    "作": 1,
    "享": 1,
    "圭": 1,
    "依": 1,
    "遷": 1,
    "問": 1,
    "立": 1,
    "奔": 1,
    "机": 1,
    "群": 1,
    "汗": 1,
    "逖": 1,
    "他": 1,
    "燕": 1,
    "鶴": 1,
    "陰": 1,
    "爵": 1,
    "吾": 1,
    "與": 1,
    "靡": 1,
    "敵": 1,
    "罷": 1,
    "几": 1,
    "匹": 1,
    "音": 1,
    "干": 1,
    "育": 1,
    "桷": 1,
    "羽": 1,
    "儀": 1,
    "饋": 1,
    "假": 1,
    "史": 1,
    "巫": 1,
    "紛": 1,
    "品": 1,
    "輻": 1,
    "目": 1,
    "疇": 1,
    "繫": 1,
    "苞": 1,
    "桑": 1,
    "傾": 1,
    "後": 1,
    "耕": 1,
    "穫": 1,
    "菑": 1,
    "畬": 1,
    "藥": 1,
    "逋": 1,
    "鞶": 1,
    "帶": 1,
    "朝": 1,
    "褫": 1,
    "素": 1,
    "咥": 1,
    "夬": 1,
    "祥": 1,
    "旋": 1,
    "畜": 1,
    "肥": 1,
    "伏": 1,
    "莽": 1,
    "升": 1,
    "興": 1,
    "攻": 1,
    "啕": 1,
    "相": 1,
    "柅": 1,
    "踟": 1,
    "躅": 1,
    "起": 1,
    "杞": 1,
    "瓜": 1,
    "隕": 1,
    "潛": 1,
    "夕": 1,
    "躍": 1,
    "淵": 1,
    "亢": 1
  },
  "per_line": [
    {
      "text": "履霜，堅冰至。",
      "tokens": [
        "履",
        "霜",
        "堅",
        "冰",
        "至"
      ]
    },
    {
      "text": "直方大，不習无不利。",
      "tokens": [
        "直",
        "方",
        "大",
        "習"
      ]
    },
    {
      "text": "含章，可貞。或從王事，无成有終。",
      "tokens": [
        "王事",
        "含",
        "章",
        "從",
        "成",
        "終"
      ]
    },
    {
      "text": "括囊，无咎无譽。",
      "tokens": [
        "括",
        "囊",
        "譽"
      ]
    },
    {
      "text": "黃裳，元吉。",
      "tokens": [
        "黃",
        "裳"
      ]
    },
    {
      "text": "龍戰于野，其血玄黃。",
      "tokens": [
        "龍",
        "戰",
        "野",
        "血",
        "玄",
        "黃"
      ]
    },
    {
      "text": "不復遠，无袛悔，元吉。",
      "tokens": [
        "遠",
        "袛"
      ]
    },
    {
      "text": "休復，吉。",
      "tokens": [
        "休"
      ]
    },
    {
      "text": "頻復，厲无咎。",
      "tokens": [
        "頻"
      ]
    },
    {
      "text": "中行獨復。",
      "tokens": [
        "中行",
        "獨"
      ]
    },
    {
      "text": "敦復，无悔。",
      "tokens": [
        "敦"
      ]
    },
    {
      "text": "迷復，凶，有災眚。用行師，終有大敗，以其國君，凶；至于十年，不克征。",
      "tokens": [
        "迷",
        "災",
        "眚",
        "行",
        "師",
        "終",
        "大",
        "敗",
        "國",
        "君",
        "至",
        "年",
        "克",
        "征"
      ]
    },
    {
      "text": "師出以律，否臧，凶。",
      "tokens": [
        "出",
        "律",
        "否",
        "臧"
      ]
    },
    {
      "text": "在師中吉，无咎；王三錫命。",
      "tokens": [
        "在",
        "中",
        "王",
        "錫",
        "命"
      ]
    },
    {
      "text": "師或輿尸，凶。",
      "tokens": [
        "輿",
        "尸"
      ]
    },
    {
      "text": "師左次，无咎。",
      "tokens": [
        "左",
        "次"
      ]
    },
    {
      "text": "田有禽，利執言，无咎。長子帥師，弟子輿尸，貞凶。",
      "tokens": [
        "田",
        "禽",
        "執",
        "言",
        "長",
        "子",
        "帥",
        "弟",
        "子",
        "輿",
        "尸"
      ]
    },
    {
      "text": "大君有命，開國承家，小人勿用。",
      "tokens": [
        "小人",
        "大君",
        "命",
        "開",
        "國",
        "承",
        "家"
      ]
    },
    {
      "text": "咸臨，貞吉。",
      "tokens": [
        "咸"
      ]
    },
    {
      "text": "咸臨，吉无不利。",
      "tokens": [
        "咸"
      ]
    },
    {
      "text": "甘臨，无攸利。既憂之，无咎。",
      "tokens": [
        "甘",
        "既",
        "憂"
      ]
    },
    {
      "text": "至臨，无咎。",
      "tokens": [
        "至"
      ]
    },
    {
      "text": "知臨，大君之宜，吉。",
      "tokens": [
        "大君",
        "知",
        "宜"
      ]
    },
    {
      "text": "敦臨，吉无咎。",
      "tokens": [
        "敦"
      ]
    },
    {
      "text": "謙謙君子，用涉大川，吉。",
      "tokens": [
        "君子",
        "大川",
        "涉"
      ]
    },
    {
      "text": "鳴謙，貞吉。",
      "tokens": [
        "鳴"
      ]
    },
    {
      "text": "勞謙君子，有終吉。",
      "tokens": [
        "君子",
        "勞"
      ]
    },
    {
      "text": "无不利，撝謙。",
      "tokens": [
        "撝"
      ]
    },
    {
      "text": "不富，以其鄰，利用侵伐，无不利。",
      "tokens": [
        "富",
        "鄰",
        "侵",
        "伐"
      ]
    },
    {
      "text": "鳴謙，利用行師，征邑國。",
      "tokens": [
        "鳴",
        "行",
        "師",
        "征",
        "邑",
        "國"
      ]
    },
    {
      "text": "明夷于飛，垂其翼。君子于行，三日不食，有攸往，主人有言。",
      "tokens": [
        "君子",
        "明夷",
        "飛",
        "垂",
        "翼",
        "行",
        "日",
        "食",
        "主",
        "人",
        "言"
      ]
    },
    {
      "text": "明夷，夷于左股，用拯馬壯，吉。",
      "tokens": [
        "明夷",
        "夷",
        "左",
        "股",
        "拯",
        "馬",
        "壯"
      ]
    },
    {
      "text": "明夷于南狩，得其大首，不可疾貞。",
      "tokens": [
        "明夷",
        "南",
        "狩",
        "得",
        "大",
        "首",
        "疾"
      ]
    },
    {
      "text": "入于左腹，獲明夷之心，于出門庭。",
      "tokens": [
        "明夷",
        "入",
        "左",
        "腹",
        "獲",
        "心",
        "出",
        "門",
        "庭"
      ]
    },
    {
      "text": "箕子之明夷，利貞。",
      "tokens": [
        "明夷",
        "箕",
        "子"
      ]
    },
    {
      "text": "不明晦，初登于天，后入于地。",
      "tokens": [
        "明",
        "晦",
        "初",
        "登",
        "天",
        "后",
        "入",
        "地"
      ]
    },
    {
      "text": "允升，大吉。",
      "tokens": [
        "允"
      ]
    },
    {
      "text": "孚乃利用禴，无咎。",
      "tokens": [
        "孚",
        "禴"
      ]
    },
    {
      "text": "升虛邑。",
      "tokens": [
        "虛",
        "邑"
      ]
    },
    {
      "text": "王用亨于岐山，吉无咎。",
      "tokens": [
        "王",
        "岐",
        "山"
      ]
    },
    {
      "text": "貞吉，升階。",
      "tokens": [
        "階"
      ]
    },
    {
      "text": "冥升，利于不息之貞。",
      "tokens": [
        "冥",
        "息"
      ]
    },
    {
      "text": "拔茅茹以其彙，征吉。",
      "tokens": [
        "拔",
        "茅",
        "茹",
        "彙"
      ]
    },
    {
      "text": "包荒。用馮河，不遐遺；朋亡。得尚于中行。",
      "tokens": [
        "中行",
        "包",
        "荒",
        "馮",
        "河",
        "遐",
        "遺",
        "朋",
        "亡",
        "得",
        "尚"
      ]
    },
    {
      "text": "无平不陂，无往不復，艱貞无咎。勿恤其孚，于食有福。",
      "tokens": [
        "平",
        "陂",
        "往",
        "復",
        "恤",
        "孚",
        "食",
        "福"
      ]
    },
    {
      "text": "翩翩，不富以其鄰；不戒以孚。",
      "tokens": [
        "翩",
        "翩",
        "富",
        "鄰",
        "戒",
        "孚"
      ]
    },
    {
      "text": "帝乙歸妹，以祉，元吉。",
      "tokens": [
        "歸妹",
        "帝",
        "乙",
        "祉"
      ]
    },
    {
      "text": "城復于隍，勿用師，自邑告命，貞吝。",
      "tokens": [
        "城",
        "復",
        "隍",
        "師",
        "自",
        "邑",
        "告",
        "命"
      ]
    },
    {
      "text": "鳴豫，凶。",
      "tokens": [
        "鳴"
      ]
    },
    {
      "text": "介于石，不終日，貞吉。",
      "tokens": [
        "介",
        "石",
        "終",
        "日"
      ]
    },
    {
      "text": "盱豫，悔。遲有悔。",
      "tokens": [
        "盱",
        "遲"
      ]
    },
    {
      "text": "由豫，大有得。勿疑。朋盍簪。",
      "tokens": [
        "由",
        "大",
        "得",
        "疑",
        "朋",
        "盍",
        "簪"
      ]
    },
    {
      "text": "貞疾，恆不死。",
      "tokens": [
        "疾",
        "恆",
        "死"
      ]
    },
    {
      "text": "冥豫，成有渝，无咎。",
      "tokens": [
        "冥",
        "成",
        "渝"
      ]
    },
    {
      "text": "震來虩虩，后笑言啞啞，吉。",
      "tokens": [
        "來",
        "虩",
        "虩",
        "后",
        "笑",
        "言",
        "啞",
        "啞"
      ]
    },
    {
      "text": "震來厲，億喪貝，躋于九陵，勿逐，七日得。",
      "tokens": [
        "來",
        "億",
        "喪",
        "貝",
        "躋",
        "陵",
        "逐",
        "日",
        "得"
      ]
    },
    {
      "text": "震蘇蘇，震行无眚。",
      "tokens": [
        "蘇",
        "蘇",
        "行",
        "眚"
      ]
    },
    {
      "text": "震遂泥。",
      "tokens": [
        "遂",
        "泥"
      ]
    },
    {
      "text": "震往來厲，億无喪，有事。",
      "tokens": [
        "往",
        "來",
        "億",
        "喪",
        "事"
      ]
    },
    {
      "text": "震索索，視矍矍，征凶。震不于其躬，于其鄰，无咎。婚媾有言。",
      "tokens": [
        "婚媾",
        "索",
        "索",
        "視",
        "矍",
        "矍",
        "躬",
        "鄰",
        "言"
      ]
    },
    {
      "text": "无咎。",
      "tokens": []
    },
    {
      "text": "田獲三狐，得黃矢，貞吉。",
      "tokens": [
        "田",
        "獲",
        "狐",
        "得",
        "黃",
        "矢"
      ]
    },
    {
      "text": "負且乘，致寇至，貞吝。",
      "tokens": [
        "負",
        "且",
        "乘",
        "致",
        "寇",
        "至"
      ]
    },
    {
      "text": "解而拇，朋至斯孚。",
      "tokens": [
        "拇",
        "朋",
        "至",
        "斯",
        "孚"
      ]
    },
    {
      "text": "君子維有解，吉；有孚于小人。",
      "tokens": [
        "君子",
        "小人",
        "維"
      ]
    },
    {
      "text": "公用射隼，于高墉之上，獲之，无不利。",
      "tokens": [
        "公",
        "射",
        "隼",
        "高",
        "墉",
        "上",
        "獲"
      ]
    },
    {
      "text": "歸妹以娣，跛能履，征吉。",
      "tokens": [
        "歸妹",
        "娣",
        "跛",
        "能",
        "履"
      ]
    },
    {
      "text": "眇能視，利幽人之貞。",
      "tokens": [
        "眇",
        "能",
        "視",
        "幽",
        "人"
      ]
    },
    {
      "text": "歸妹以須，反歸以娣。",
      "tokens": [
        "歸妹",
        "須",
        "反",
        "歸",
        "娣"
      ]
    },
    {
      "text": "歸妹愆期，遲歸有時。",
      "tokens": [
        "歸妹",
        "愆",
        "期",
        "遲",
        "歸",
        "時"
      ]
    },
    {
      "text": "帝乙歸妹，其君之袂，不如其娣之袂良，月幾望，吉。",
      "tokens": [
        "歸妹",
        "帝",
        "乙",
        "君",
        "袂",
        "娣",
        "袂",
        "良",
        "月",
        "幾",
        "望"
      ]
    },
    {
      "text": "女承筐无實，士刲羊无血，无攸利。",
      "tokens": [
        "女",
        "承",
        "筐",
        "實",
        "士",
        "刲",
        "羊",
        "血"
      ]
    },
    {
      "text": "飛鳥以凶。",
      "tokens": [
        "飛",
        "鳥"
      ]
    },
    {
      "text": "過其祖，遇其妣；不及其君，遇其臣；无咎。",
      "tokens": [
        "過",
        "祖",
        "遇",
        "妣",
        "及",
        "君",
        "遇",
        "臣"
      ]
    },
    {
      "text": "弗過防之，從或戕之，凶。",
      "tokens": [
        "過",
        "防",
        "從",
        "戕"
      ]
    },
    {
      "text": "无咎，弗過遇之。往厲必戒，勿用永貞。",
      "tokens": [
        "過",
        "遇",
        "往",
        "必",
        "戒"
      ]
    },
    {
      "text": "密云不雨，自我西郊，公弋取彼在穴。",
      "tokens": [
        "密",
        "云",
        "雨",
        "自",
        "我",
        "西",
        "郊",
        "公",
        "弋",
        "取",
        "彼",
        "在",
        "穴"
      ]
    },
    {
      "text": "弗遇過之，飛鳥離之，凶，是謂災眚。",
      "tokens": [
        "遇",
        "過",
        "飛",
        "鳥",
        "離",
        "是",
        "謂",
        "災",
        "眚"
      ]
    },
    {
      "text": "遇其配主，雖旬无咎，往有尚。",
      "tokens": [
        "遇",
        "配",
        "主",
        "雖",
        "旬",
        "往",
        "尚"
      ]
    },
    {
      "text": "豐其蔀，日中見斗，往得疑疾，有孚發若，吉。",
      "tokens": [
        "蔀",
        "日",
        "中",
        "見",
        "斗",
        "往",
        "得",
        "疑",
        "疾",
        "發"
      ]
    },
    {
      "text": "豐其沛，日中見沫，折其右肱，无咎。",
      "tokens": [
        "沛",
        "日",
        "中",
        "見",
        "沫",
        "折",
        "右",
        "肱"
      ]
    },
    {
      "text": "豐其蔀，日中見斗，遇其夷主，吉。",
      "tokens": [
        "蔀",
        "日",
        "中",
        "見",
        "斗",
        "遇",
        "夷",
        "主"
      ]
    },
    {
      "text": "來章，有慶譽，吉。",
      "tokens": [
        "來",
        "章",
        "慶",
        "譽"
      ]
    },
    {
      "text": "豐其屋，蔀其家，窺其戶，闃其无人，三歲不觌，凶。",
      "tokens": [
        "屋",
        "蔀",
        "家",
        "窺",
        "戶",
        "闃",
        "人",
        "歲",
        "觌"
      ]
    },
    {
      "text": "浚恆，貞凶，无攸利。",
      "tokens": [
        "浚"
      ]
    },
    {
      "text": "悔亡。",
      "tokens": []
    },
    {
      "text": "不恆其德，或承之羞，貞吝。",
      "tokens": [
        "德",
        "承",
        "羞"
      ]
    },
    {
      "text": "田无禽。",
      "tokens": [
        "田",
        "禽"
      ]
    },
    {
      "text": "恆其德，貞，婦人吉，夫子凶。",
      "tokens": [
        "德",
        "婦",
        "人",
        "夫",
        "子"
      ]
    },
    {
      "text": "振恆，凶。",
      "tokens": [
        "振"
      ]
    },
    {
      "text": "壯于趾，征凶，有孚。",
      "tokens": [
        "壯",
        "趾"
      ]
    },
    {
      "text": "貞吉。",
      "tokens": []
    },
    {
      "text": "小人用壯，君子用罔，貞厲。羝羊觸藩，羸其角。",
      "tokens": [
        "君子",
        "小人",
        "壯",
        "罔",
        "羝",
        "羊",
        "觸",
        "藩",
        "羸",
        "角"
      ]
    },
    {
      "text": "貞吉悔亡，藩決不羸，壯于大輿之輹。",
      "tokens": [
        "藩",
        "決",
        "羸",
        "壯",
        "大",
        "輿",
        "輹"
      ]
    },
    {
      "text": "喪羊于易，无悔。",
      "tokens": [
        "喪",
        "羊",
        "易"
      ]
    },
    {
      "text": "羝羊觸藩，不能退，不能遂，无攸利，艱則吉。",
      "tokens": [
        "羝",
        "羊",
        "觸",
        "藩",
        "能",
        "退",
        "能",
        "遂",
        "艱"
      ]
    },
    {
      "text": "有孚，比之，无咎。有孚盈缶，終來有它，吉。",
      "tokens": [
        "盈",
        "缶",
        "終",
        "來",
        "它"
      ]
    },
    {
      "text": "比之自內，貞吉。",
      "tokens": [
        "自",
        "內"
      ]
    },
    {
      "text": "比之匪人。",
      "tokens": [
        "人"
      ]
    },
    {
      "text": "外比之，貞吉。",
      "tokens": [
        "外"
      ]
    },
    {
      "text": "顯比。王用三驅，失前禽，邑人不誡，吉。",
      "tokens": [
        "邑人",
        "顯",
        "王",
        "驅",
        "失",
        "前",
        "禽",
        "誡"
      ]
    },
    {
      "text": "比之无首，凶。",
      "tokens": [
        "首"
      ]
    },
    {
      "text": "磐桓，利居貞，利建侯。",
      "tokens": [
        "磐",
        "桓",
        "居",
        "建",
        "侯"
      ]
    },
    {
      "text": "屯如邅如，乘馬班如，匪寇婚媾，女子貞不字，十年乃字。",
      "tokens": [
        "婚媾",
        "乘馬",
        "邅",
        "班",
        "寇",
        "女",
        "子",
        "字",
        "年",
        "字"
      ]
    },
    {
      "text": "即鹿无虞，惟入于林中，君子幾不如舍，往吝。",
      "tokens": [
        "君子",
        "即",
        "鹿",
        "虞",
        "惟",
        "入",
        "林",
        "中",
        "幾",
        "舍",
        "往"
      ]
    },
    {
      "text": "乘馬班如，求婚媾，往，吉无不利。",
      "tokens": [
        "婚媾",
        "乘馬",
        "班",
        "求",
        "往"
      ]
    },
    {
      "text": "屯其膏；小貞吉，大貞凶。",
      "tokens": [
        "膏",
        "小",
        "大"
      ]
    },
    {
      "text": "乘馬班如，泣血漣如。",
      "tokens": [
        "乘馬",
        "班",
        "泣",
        "血",
        "漣"
      ]
    },
    {
      "text": "習坎，入于坎窞，凶。",
      "tokens": [
        "習",
        "入",
        "窞"
      ]
    },
    {
      "text": "坎有險，求小得。",
      "tokens": [
        "險",
        "求",
        "小",
        "得"
      ]
    },
    {
      "text": "來之坎坎，險且枕，入于坎窞，勿用。",
      "tokens": [
        "來",
        "險",
        "且",
        "枕",
        "入",
        "窞"
      ]
    },
    {
      "text": "樽酒簋貳，用缶，納約自牖，終无咎。",
      "tokens": [
        "樽",
        "酒",
        "簋",
        "貳",
        "缶",
        "納",
        "約",
        "自",
        "牖",
        "終"
      ]
    },
    {
      "text": "坎不盈，祗既平，无咎。",
      "tokens": [
        "盈",
        "祗",
        "既",
        "平"
      ]
    },
    {
      "text": "係用徽纆，寘于叢棘，三歲不得，凶。",
      "tokens": [
        "係",
        "徽",
        "纆",
        "寘",
        "叢",
        "棘",
        "歲",
        "得"
      ]
    },
    {
      "text": "不出戶庭，无咎。",
      "tokens": [
        "出",
        "戶",
        "庭"
      ]
    },
    {
      "text": "不出門庭，凶。",
      "tokens": [
        "出",
        "門",
        "庭"
      ]
    },
    {
      "text": "不節若，則嗟若，无咎。",
      "tokens": [
        "嗟"
      ]
    },
    {
      "text": "安節，亨。",
      "tokens": [
        "安"
      ]
    },
    {
      "text": "甘節，吉；往有尚。",
      "tokens": [
        "甘",
        "往",
        "尚"
      ]
    },
    {
      "text": "苦節，貞凶，悔亡。",
      "tokens": [
        "苦"
      ]
    },
    {
      "text": "往蹇，來譽。",
      "tokens": [
        "往",
        "來",
        "譽"
      ]
    },
    {
      "text": "王臣蹇蹇，匪躬之故。",
      "tokens": [
        "王",
        "臣",
        "躬",
        "故"
      ]
    },
    {
      "text": "往蹇來反。",
      "tokens": [
        "往",
        "來",
        "反"
      ]
    },
    {
      "text": "往蹇來連。",
      "tokens": [
        "往",
        "來",
        "連"
      ]
    },
    {
      "text": "大蹇朋來。",
      "tokens": [
        "大",
        "朋",
        "來"
      ]
    },
    {
      "text": "往蹇來碩，吉；利見大人。",
      "tokens": [
        "大人",
        "往",
        "來",
        "碩",
        "見"
      ]
    },
    {
      "text": "曳其輪，濡其尾，无咎。",
      "tokens": [
        "曳",
        "輪",
        "濡",
        "尾"
      ]
    },
    {
      "text": "婦喪其茀，勿逐，七日得。",
      "tokens": [
        "婦",
        "喪",
        "茀",
        "逐",
        "日",
        "得"
      ]
    },
    {
      "text": "高宗伐鬼方，三年克之，小人勿用。",
      "tokens": [
        "小人",
        "高",
        "宗",
        "伐",
        "鬼",
        "方",
        "年",
        "克"
      ]
    },
    {
      "text": "繻有衣袽，終日戒。",
      "tokens": [
        "繻",
        "衣",
        "袽",
        "終",
        "日",
        "戒"
      ]
    },
    {
      "text": "東鄰殺牛，不如西鄰之禴祭，實受其福。",
      "tokens": [
        "東",
        "鄰",
        "殺",
        "牛",
        "西",
        "鄰",
        "禴",
        "祭",
        "實",
        "受",
        "福"
      ]
    },
    {
      "text": "濡其首，厲。",
      "tokens": [
        "濡",
        "首"
      ]
    },
    {
      "text": "井泥不食，舊井无禽。",
      "tokens": [
        "泥",
        "食",
        "舊",
        "禽"
      ]
    },
    {
      "text": "井谷射鮒，瓮敝漏。",
      "tokens": [
        "谷",
        "射",
        "鮒",
        "瓮",
        "敝",
        "漏"
      ]
    },
    {
      "text": "井渫不食，為我心惻，可用汲，王明，并受其福。",
      "tokens": [
        "渫",
        "食",
        "我",
        "心",
        "惻",
        "汲",
        "王",
        "明",
        "并",
        "受",
        "福"
      ]
    },
    {
      "text": "井甃，无咎。",
      "tokens": [
        "甃"
      ]
    },
    {
      "text": "井冽，寒泉食。",
      "tokens": [
        "冽",
        "寒",
        "泉",
        "食"
      ]
    },
    {
      "text": "井收勿幕，有孚元吉。",
      "tokens": [
        "收",
        "幕"
      ]
    },
    {
      "text": "需于郊，利用恆，无咎。",
      "tokens": [
        "郊",
        "恆"
      ]
    },
    {
      "text": "需于沙，小有言，終吉。",
      "tokens": [
        "沙",
        "小",
        "言"
      ]
    },
    {
      "text": "需于泥，致寇至。",
      "tokens": [
        "泥",
        "致",
        "寇",
        "至"
      ]
    },
    {
      "text": "需于血，出自穴。",
      "tokens": [
        "血",
        "出",
        "自",
        "穴"
      ]
    },
    {
      "text": "需于酒食，貞吉。",
      "tokens": [
        "酒",
        "食"
      ]
    },
    {
      "text": "入于穴，有不速之客三人來，敬之終吉。",
      "tokens": [
        "入",
        "穴",
        "速",
        "客",
        "人",
        "來",
        "敬"
      ]
    },
    {
      "text": "有孚不終，乃亂乃萃，若號一握為笑，勿恤，往无咎。",
      "tokens": [
        "終",
        "亂",
        "號",
        "握",
        "笑",
        "恤",
        "往"
      ]
    },
    {
      "text": "引吉，无咎，孚乃利用禴。",
      "tokens": [
        "引",
        "孚",
        "禴"
      ]
    },
    {
      "text": "萃如，嗟如，无攸利，往无咎，小吝。",
      "tokens": [
        "嗟",
        "往",
        "小"
      ]
    },
    {
      "text": "大吉，无咎。",
      "tokens": []
    },
    {
      "text": "萃有位，无咎。匪孚，元永貞，悔亡。",
      "tokens": [
        "位",
        "孚"
      ]
    },
    {
      "text": "齎咨涕洟，无咎。",
      "tokens": [
        "齎",
        "咨",
        "涕",
        "洟"
      ]
    },
    {
      "text": "官有渝，貞吉。出門交有功。",
      "tokens": [
        "官",
        "渝",
        "出",
        "門",
        "交",
        "功"
      ]
    },
    {
      "text": "系小子，失丈夫。",
      "tokens": [
        "系",
        "小",
        "子",
        "失",
        "丈",
        "夫"
      ]
    },
    {
      "text": "系丈夫，失小子。隨，有求得利，居貞。",
      "tokens": [
        "系",
        "丈",
        "夫",
        "失",
        "小",
        "子",
        "求",
        "得",
        "居"
      ]
    },
    {
      "text": "隨有獲，貞凶。有孚在道，以明，何咎。",
      "tokens": [
        "獲",
        "在",
        "道",
        "明",
        "何"
      ]
    },
    {
      "text": "孚于嘉，吉。",
      "tokens": [
        "孚",
        "嘉"
      ]
    },
    {
      "text": "拘系之，乃從維之。王用亨于西山。",
      "tokens": [
        "拘",
        "系",
        "從",
        "維",
        "王",
        "西",
        "山"
      ]
    },
    {
      "text": "臀困于株木，入于幽谷，三歲不覿。",
      "tokens": [
        "臀",
        "株",
        "木",
        "入",
        "幽",
        "谷",
        "歲",
        "覿"
      ]
    },
    {
      "text": "困于酒食，朱紱方來，利用亨祀，征凶，无咎。",
      "tokens": [
        "酒",
        "食",
        "朱",
        "紱",
        "方",
        "來",
        "祀"
      ]
    },
    {
      "text": "困于石，據于蒺藜，入于其宮，不見其妻，凶。",
      "tokens": [
        "石",
        "據",
        "蒺",
        "藜",
        "入",
        "宮",
        "見",
        "妻"
      ]
    },
    {
      "text": "來徐徐，困于金車，吝，有終。",
      "tokens": [
        "來",
        "徐",
        "徐",
        "金",
        "車",
        "終"
      ]
    },
    {
      "text": "劓刖，困于赤紱，乃徐有說，利用祭祀。",
      "tokens": [
        "劓",
        "刖",
        "赤",
        "紱",
        "徐",
        "說",
        "祭",
        "祀"
      ]
    },
    {
      "text": "困于葛藟，于臲卼，曰動悔。有悔，征吉。",
      "tokens": [
        "葛",
        "藟",
        "臲",
        "卼",
        "動"
      ]
    },
    {
      "text": "和兌，吉。",
      "tokens": [
        "和"
      ]
    },
    {
      "text": "孚兌，吉，悔亡。",
      "tokens": [
        "孚"
      ]
    },
    {
      "text": "來兌，凶。",
      "tokens": [
        "來"
      ]
    },
    {
      "text": "商兌，未寧，介疾有喜。",
      "tokens": [
        "商",
        "未",
        "寧",
        "介",
        "疾",
        "喜"
      ]
    },
    {
      "text": "孚于剝，有厲。",
      "tokens": [
        "孚",
        "剝"
      ]
    },
    {
      "text": "引兌。",
      "tokens": [
        "引"
      ]
    },
    {
      "text": "咸其拇。",
      "tokens": [
        "拇"
      ]
    },
    {
      "text": "咸其腓，凶，居吉。",
      "tokens": [
        "腓",
        "居"
      ]
    },
    {
      "text": "咸其股，執其隨，往吝。",
      "tokens": [
        "股",
        "執",
        "隨",
        "往"
      ]
    },
    {
      "text": "貞吉悔亡，憧憧往來，朋從爾思。",
      "tokens": [
        "憧",
        "憧",
        "往",
        "來",
        "朋",
        "從",
        "爾",
        "思"
      ]
    },
    {
      "text": "咸其脢，无悔。",
      "tokens": [
        "脢"
      ]
    },
    {
      "text": "咸其輔，頰，舌。",
      "tokens": [
        "輔",
        "頰",
        "舌"
      ]
    },
    {
      "text": "鞏用黃牛之革。",
      "tokens": [
        "鞏",
        "黃",
        "牛"
      ]
    },
    {
      "text": "己日乃革之，征吉，无咎。",
      "tokens": [
        "己",
        "日"
      ]
    },
    {
      "text": "征凶，貞厲，革言三就，有孚。",
      "tokens": [
        "言",
        "就"
      ]
    },
    {
      "text": "悔亡，有孚改命，吉。",
      "tokens": [
        "改",
        "命"
      ]
    },
    {
      "text": "大人虎變，未占有孚。",
      "tokens": [
        "大人",
        "虎",
        "變",
        "未",
        "占"
      ]
    },
    {
      "text": "君子豹變，小人革面，征凶，居貞吉。",
      "tokens": [
        "君子",
        "小人",
        "豹",
        "變",
        "面",
        "居"
      ]
    },
    {
      "text": "藉用白茅，无咎。",
      "tokens": [
        "藉",
        "白",
        "茅"
      ]
    },
    {
      "text": "枯楊生稊，老夫得其女妻，无不利。",
      "tokens": [
        "枯",
        "楊",
        "生",
        "稊",
        "老",
        "夫",
        "得",
        "女",
        "妻"
      ]
    },
    {
      "text": "棟橈，凶。",
      "tokens": [
        "棟",
        "橈"
      ]
    },
    {
      "text": "棟隆，吉。有它吝。",
      "tokens": [
        "棟",
        "隆",
        "它"
      ]
    },
    {
      "text": "枯楊生華，老婦得其士夫，无咎无譽。",
      "tokens": [
        "枯",
        "楊",
        "生",
        "華",
        "老",
        "婦",
        "得",
        "士",
        "夫",
        "譽"
      ]
    },
    {
      "text": "過涉滅頂，凶，无咎。",
      "tokens": [
        "過",
        "涉",
        "滅",
        "頂"
      ]
    },
    {
      "text": "壯于前趾，往不勝為咎。",
      "tokens": [
        "壯",
        "前",
        "趾",
        "往",
        "勝"
      ]
    },
    {
      "text": "惕號，莫夜有戎，勿恤。",
      "tokens": [
        "惕",
        "號",
        "莫",
        "夜",
        "戎",
        "恤"
      ]
    },
    {
      "text": "壯于頄，有凶。君子夬夬，獨行遇雨，若濡有慍，无咎。",
      "tokens": [
        "君子",
        "壯",
        "頄",
        "獨",
        "行",
        "遇",
        "雨",
        "濡",
        "慍"
      ]
    },
    {
      "text": "臀无膚，其行次且。牽羊悔亡，聞言不信。",
      "tokens": [
        "臀",
        "膚",
        "行",
        "次",
        "且",
        "牽",
        "羊",
        "聞",
        "言",
        "信"
      ]
    },
    {
      "text": "莧陸夬夬，中行无咎。",
      "tokens": [
        "中行",
        "莧",
        "陸"
      ]
    },
    {
      "text": "无號，終有凶。",
      "tokens": [
        "號",
        "終"
      ]
    },
    {
      "text": "剝牀以足，蔑貞凶。",
      "tokens": [
        "牀",
        "足",
        "蔑"
      ]
    },
    {
      "text": "剝牀以辨，蔑貞凶。",
      "tokens": [
        "牀",
        "辨",
        "蔑"
      ]
    },
    {
      "text": "剝之，无咎。",
      "tokens": []
    },
    {
      "text": "剝牀以膚，凶。",
      "tokens": [
        "牀",
        "膚"
      ]
    },
    {
      "text": "貫魚，以宮人寵，无不利。",
      "tokens": [
        "貫",
        "魚",
        "宮",
        "人",
        "寵"
      ]
    },
    {
      "text": "碩果不食，君子得輿，小人剝廬。",
      "tokens": [
        "君子",
        "小人",
        "碩",
        "果",
        "食",
        "得",
        "輿",
        "廬"
      ]
    },
    {
      "text": "舍爾靈龜，觀我朵頤，凶。",
      "tokens": [
        "舍",
        "爾",
        "靈",
        "龜",
        "觀",
        "我",
        "朵"
      ]
    },
    {
      "text": "顛頤，拂經，于丘頤，征凶。",
      "tokens": [
        "顛",
        "拂",
        "經",
        "丘"
      ]
    },
    {
      "text": "拂頤，貞凶，十年勿用，无攸利。",
      "tokens": [
        "拂",
        "年"
      ]
    },
    {
      "text": "顛頤吉，虎視眈眈，其欲逐逐，无咎。",
      "tokens": [
        "顛",
        "虎",
        "視",
        "眈",
        "眈",
        "欲",
        "逐",
        "逐"
      ]
    },
    {
      "text": "拂經，居貞吉，不可涉大川。",
      "tokens": [
        "大川",
        "拂",
        "經",
        "居",
        "涉"
      ]
    },
    {
      "text": "由頤，厲吉，利涉大川。",
      "tokens": [
        "大川",
        "由",
        "涉"
      ]
    },
    {
      "text": "發蒙，利用刑人，用說桎梏，以往吝。",
      "tokens": [
        "桎梏",
        "發",
        "刑",
        "人",
        "說",
        "往"
      ]
    },
    {
      "text": "包蒙吉，納婦吉，子克家。",
      "tokens": [
        "包",
        "納",
        "婦",
        "子",
        "克",
        "家"
      ]
    },
    {
      "text": "勿用取女，見金夫，不有躬，无攸利。",
      "tokens": [
        "金夫",
        "取",
        "女",
        "見",
        "躬"
      ]
    },
    {
      "text": "困蒙，吝。",
      "tokens": [
        "困"
      ]
    },
    {
      "text": "童蒙，吉。",
      "tokens": [
        "童"
      ]
    },
    {
      "text": "擊蒙，不利為寇，利禦寇。",
      "tokens": [
        "擊",
        "寇",
        "禦",
        "寇"
      ]
    },
    {
      "text": "已事遄往，无咎，酌損之。",
      "tokens": [
        "已",
        "事",
        "遄",
        "往",
        "酌"
      ]
    },
    {
      "text": "利貞，征凶，弗損益之。",
      "tokens": [
        "益"
      ]
    },
    {
      "text": "三人行，則損一人；一人行，則得其友。",
      "tokens": [
        "人",
        "行",
        "人",
        "人",
        "行",
        "得",
        "友"
      ]
    },
    {
      "text": "損其疾，使遄有喜，无咎。",
      "tokens": [
        "疾",
        "使",
        "遄",
        "喜"
      ]
    },
    {
      "text": "或益之，十朋之龜弗克違，元吉。",
      "tokens": [
        "益",
        "朋",
        "龜",
        "克",
        "違"
      ]
    },
    {
      "text": "弗損益之，无咎，貞吉，利有攸往，得臣无家。",
      "tokens": [
        "益",
        "得",
        "臣",
        "家"
      ]
    },
    {
      "text": "艮其趾，无咎，利永貞。",
      "tokens": [
        "趾"
      ]
    },
    {
      "text": "艮其腓，不拯其隨，其心不快。",
      "tokens": [
        "腓",
        "拯",
        "隨",
        "心",
        "快"
      ]
    },
    {
      "text": "艮其限，列其夤，厲薰心。",
      "tokens": [
        "限",
        "列",
        "夤",
        "薰",
        "心"
      ]
    },
    {
      "text": "艮其身，无咎。",
      "tokens": [
        "身"
      ]
    },
    {
      "text": "艮其輔，言有序，悔亡。",
      "tokens": [
        "輔",
        "言",
        "序"
      ]
    },
    {
      "text": "敦艮，吉。",
      "tokens": [
        "敦"
      ]
    },
    {
      "text": "賁其趾，舍車而徒。",
      "tokens": [
        "趾",
        "舍",
        "車",
        "徒"
      ]
    },
    {
      "text": "賁其須。",
      "tokens": [
        "須"
      ]
    },
    {
      "text": "賁如濡如，永貞吉。",
      "tokens": [
        "濡",
        "永"
      ]
    },
    {
      "text": "賁如皤如，白馬翰如，匪寇婚媾。",
      "tokens": [
        "婚媾",
        "皤",
        "白",
        "馬",
        "翰",
        "寇"
      ]
    },
    {
      "text": "賁於丘園，束帛戔戔，吝，終吉。",
      "tokens": [
        "於",
        "丘",
        "園",
        "束",
        "帛",
        "戔",
        "戔"
      ]
    },
    {
      "text": "白賁，无咎。",
      "tokens": [
        "白"
      ]
    },
    {
      "text": "幹父之蠱，有子考，无咎，厲終吉。",
      "tokens": [
        "幹",
        "父",
        "子",
        "考"
      ]
    },
    {
      "text": "幹母之蠱，不可貞。",
      "tokens": [
        "幹",
        "母"
      ]
    },
    {
      "text": "幹父之蠱，小有悔，无大咎。",
      "tokens": [
        "幹",
        "父",
        "小",
        "大"
      ]
    },
    {
      "text": "裕父之蠱，往見吝。",
      "tokens": [
        "裕",
        "父",
        "往",
        "見"
      ]
    },
    {
      "text": "幹父之蠱，用譽。",
      "tokens": [
        "幹",
        "父",
        "譽"
      ]
    },
    {
      "text": "不事王侯，高尚其事。",
      "tokens": [
        "事",
        "王",
        "侯",
        "高",
        "尚",
        "事"
      ]
    },
    {
      "text": "有厲利已。",
      "tokens": [
        "已"
      ]
    },
    {
      "text": "輿說輹。",
      "tokens": [
        "輿",
        "說",
        "輹"
      ]
    },
    {
      "text": "良馬逐，利艱貞。曰閑輿衛，利有攸往。",
      "tokens": [
        "良",
        "馬",
        "逐",
        "閑",
        "輿",
        "衛"
      ]
    },
    {
      "text": "童牛之牿，元吉。",
      "tokens": [
        "童",
        "牛",
        "牿"
      ]
    },
    {
      "text": "豶豕之牙，吉。",
      "tokens": [
        "豶",
        "豕",
        "牙"
      ]
    },
    {
      "text": "何天之衢，亨。",
      "tokens": [
        "何",
        "天",
        "衢"
      ]
    },
    {
      "text": "晉如，摧如，貞吉。罔孚，裕无咎。",
      "tokens": [
        "摧",
        "罔",
        "孚",
        "裕"
      ]
    },
    {
      "text": "晉如，愁如，貞吉。受茲介福，于其王母。",
      "tokens": [
        "愁",
        "受",
        "茲",
        "介",
        "福",
        "王",
        "母"
      ]
    },
    {
      "text": "眾允，悔亡。",
      "tokens": [
        "眾",
        "允"
      ]
    },
    {
      "text": "晉如鼫鼠，貞厲。",
      "tokens": [
        "鼫",
        "鼠"
      ]
    },
    {
      "text": "悔亡，失得勿恤，往吉无不利。",
      "tokens": [
        "失",
        "得",
        "恤",
        "往"
      ]
    },
    {
      "text": "晉其角，維用伐邑，厲吉无咎，貞吝。",
      "tokens": [
        "角",
        "維",
        "伐",
        "邑"
      ]
    },
    {
      "text": "屨校滅趾，无咎。",
      "tokens": [
        "屨",
        "校",
        "滅",
        "趾"
      ]
    },
    {
      "text": "噬膚滅鼻，无咎。",
      "tokens": [
        "噬",
        "膚",
        "滅",
        "鼻"
      ]
    },
    {
      "text": "噬臘肉，遇毒；小吝，无咎。",
      "tokens": [
        "噬",
        "臘",
        "肉",
        "遇",
        "毒",
        "小"
      ]
    },
    {
      "text": "噬乾胏，得金矢，利艱貞，吉。",
      "tokens": [
        "噬",
        "乾",
        "胏",
        "得",
        "金",
        "矢",
        "艱"
      ]
    },
    {
      "text": "噬乾肉，得黃金，貞厲，无咎。",
      "tokens": [
        "噬",
        "乾",
        "肉",
        "得",
        "黃",
        "金"
      ]
    },
    {
      "text": "何校滅耳，凶。",
      "tokens": [
        "何",
        "校",
        "滅",
        "耳"
      ]
    },
    {
      "text": "濡其尾，吝。",
      "tokens": [
        "濡",
        "尾"
      ]
    },
    {
      "text": "曳其輪，貞吉。",
      "tokens": [
        "曳",
        "輪"
      ]
    },
    {
      "text": "未濟，征凶，利涉大川。",
      "tokens": [
        "大川",
        "涉"
      ]
    },
    {
      "text": "貞吉，悔亡，震用伐鬼方，三年有賞于大國。",
      "tokens": [
        "震",
        "伐",
        "鬼",
        "方",
        "年",
        "賞",
        "大",
        "國"
      ]
    },
    {
      "text": "貞吉，无悔，君子之光，有孚，吉。",
      "tokens": [
        "君子",
        "光"
      ]
    },
    {
      "text": "有孚于飲酒，无咎，濡其首，有孚失是。",
      "tokens": [
        "飲",
        "酒",
        "濡",
        "首",
        "失",
        "是"
      ]
    },
    {
      "text": "悔亡，喪馬勿逐，自復；見惡人无咎。",
      "tokens": [
        "喪",
        "馬",
        "逐",
        "自",
        "復",
        "見",
        "惡",
        "人"
      ]
    },
    {
      "text": "遇主于巷，无咎。",
      "tokens": [
        "遇",
        "主",
        "巷"
      ]
    },
    {
      "text": "見輿曳，其牛掣，其人天且劓，无初有終。",
      "tokens": [
        "見",
        "輿",
        "曳",
        "牛",
        "掣",
        "人",
        "天",
        "且",
        "劓",
        "初",
        "終"
      ]
    },
    {
      "text": "睽孤，遇元夫，交孚，厲无咎。",
      "tokens": [
        "孤",
        "遇",
        "夫",
        "交",
        "孚"
      ]
    },
    {
      "text": "悔亡，厥宗噬膚，往何咎。",
      "tokens": [
        "厥",
        "宗",
        "噬",
        "膚",
        "往",
        "何"
      ]
    },
    {
      "text": "睽孤， 見豕負涂，載鬼一車， 先張之弧，后說之弧，匪寇婚媾，往遇雨則吉。",
      "tokens": [
        "婚媾",
        "孤",
        "見",
        "豕",
        "負",
        "涂",
        "載",
        "鬼",
        "車",
        "先",
        "張",
        "弧",
        "后",
        "說",
        "弧",
        "寇",
        "往",
        "遇",
        "雨"
      ]
    },
    {
      "text": "旅瑣瑣，斯其所取災。",
      "tokens": [
        "瑣",
        "瑣",
        "斯",
        "所",
        "取",
        "災"
      ]
    },
    {
      "text": "旅即次，懷其資，得童僕貞。",
      "tokens": [
        "即",
        "次",
        "懷",
        "資",
        "得",
        "童",
        "僕"
      ]
    },
    {
      "text": "旅焚其次，喪其童僕，貞厲。",
      "tokens": [
        "焚",
        "次",
        "喪",
        "童",
        "僕"
      ]
    },
    {
      "text": "旅于處，得其資斧，我心不快。",
      "tokens": [
        "處",
        "得",
        "資",
        "斧",
        "我",
        "心",
        "快"
      ]
    },
    {
      "text": "射雉一矢亡，終以譽命。",
      "tokens": [
        "射",
        "雉",
        "矢",
        "亡",
        "終",
        "譽",
        "命"
      ]
    },
    {
      "text": "鳥焚其巢，旅人先笑后號咷。喪牛于易，凶。",
      "tokens": [
        "鳥",
        "焚",
        "巢",
        "人",
        "先",
        "笑",
        "后",
        "號",
        "咷",
        "喪",
        "牛",
        "易"
      ]
    },
    {
      "text": "履錯然，敬之无咎。",
      "tokens": [
        "履",
        "錯",
        "然",
        "敬"
      ]
    },
    {
      "text": "黃離，元吉。",
      "tokens": [
        "黃"
      ]
    },
    {
      "text": "日昃之離，不鼓缶而歌，則大耋之嗟，凶。",
      "tokens": [
        "日",
        "昃",
        "鼓",
        "缶",
        "歌",
        "大",
        "耋",
        "嗟"
      ]
    },
    {
      "text": "突如其來如，焚如，死如，棄如。",
      "tokens": [
        "突",
        "來",
        "焚",
        "死",
        "棄"
      ]
    },
    {
      "text": "出涕沱若，戚嗟若，吉。",
      "tokens": [
        "出",
        "涕",
        "沱",
        "戚",
        "嗟"
      ]
    },
    {
      "text": "王用出征，有嘉折首，獲匪其醜，无咎。",
      "tokens": [
        "王",
        "出",
        "征",
        "嘉",
        "折",
        "首",
        "獲",
        "醜"
      ]
    },
    {
      "text": "鼎顛趾，利出否，得妾以其子，无咎。",
      "tokens": [
        "顛",
        "趾",
        "出",
        "否",
        "得",
        "妾",
        "子"
      ]
    },
    {
      "text": "鼎有實，我仇有疾，不我能即，吉。",
      "tokens": [
        "實",
        "我",
        "仇",
        "疾",
        "我",
        "能",
        "即"
      ]
    },
    {
      "text": "鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。",
      "tokens": [
        "耳",
        "革",
        "行",
        "塞",
        "雉",
        "膏",
        "食",
        "方",
        "雨",
        "虧"
      ]
    },
    {
      "text": "鼎折足，覆公餗，其形渥，凶。",
      "tokens": [
        "折",
        "足",
        "覆",
        "公",
        "餗",
        "形",
        "渥"
      ]
    },
    {
      "text": "鼎黃耳金鉉，利貞。",
      "tokens": [
        "黃",
        "耳",
        "金",
        "鉉"
      ]
    },
    {
      "text": "鼎玉鉉，大吉，无不利。",
      "tokens": [
        "玉",
        "鉉"
      ]
    },
    {
      "text": "无交害，匪咎，艱則无咎。",
      "tokens": [
        "交",
        "害",
        "艱"
      ]
    },
    {
      "text": "大車以載，有攸往，无咎。",
      "tokens": [
        "大",
        "車",
        "載"
      ]
    },
    {
      "text": "公用亨于天子，小人弗克。",
      "tokens": [
        "小人",
        "公",
        "天",
        "子",
        "克"
      ]
    },
    {
      "text": "匪其彭，无咎。",
      "tokens": [
        "彭"
      ]
    },
    {
      "text": "厥孚交如，威如；吉。",
      "tokens": [
        "厥",
        "孚",
        "交",
        "威"
      ]
    },
    {
      "text": "自天佑之，吉无不利。",
      "tokens": [
        "自",
        "天",
        "佑"
      ]
    },
    {
      "text": "童觀，小人无咎，君子吝。",
      "tokens": [
        "君子",
        "小人",
        "童"
      ]
    },
    {
      "text": "窺觀，利女貞。",
      "tokens": [
        "窺",
        "女"
      ]
    },
    {
      "text": "觀我生，進退。",
      "tokens": [
        "我",
        "生",
        "進",
        "退"
      ]
    },
    {
      "text": "觀國之光，利用賓于王。",
      "tokens": [
        "國",
        "光",
        "賓",
        "王"
      ]
    },
    {
      "text": "觀我生，君子无咎。",
      "tokens": [
        "君子",
        "我",
        "生"
      ]
    },
    {
      "text": "觀其生，君子无咎。",
      "tokens": [
        "君子",
        "生"
      ]
    },
    {
      "text": "利用為大作，元吉，无咎。",
      "tokens": [
        "大",
        "作"
      ]
    },
    {
      "text": "或益之，十朋之龜弗克違，永貞吉。王用享于帝，吉。",
      "tokens": [
        "朋",
        "龜",
        "克",
        "違",
        "永",
        "王",
        "享",
        "帝"
      ]
    },
    {
      "text": "益之用凶事，无咎。有孚中行，告公用圭。",
      "tokens": [
        "中行",
        "事",
        "告",
        "公",
        "圭"
      ]
    },
    {
      "text": "中行，告公從。利用為依遷國。",
      "tokens": [
        "中行",
        "告",
        "公",
        "從",
        "依",
        "遷",
        "國"
      ]
    },
    {
      "text": "有孚惠心，勿問元吉。有孚惠我德。",
      "tokens": [
        "惠",
        "心",
        "問",
        "惠",
        "我",
        "德"
      ]
    },
    {
      "text": "莫益之，或擊之，立心勿恆，凶。",
      "tokens": [
        "莫",
        "擊",
        "立",
        "心",
        "恆"
      ]
    },
    {
      "text": "用拯馬壯，吉。",
      "tokens": [
        "拯",
        "馬",
        "壯"
      ]
    },
    {
      "text": "渙奔其机，悔亡。",
      "tokens": [
        "奔",
        "机"
      ]
    },
    {
      "text": "渙其躬，无悔。",
      "tokens": [
        "躬"
      ]
    },
    {
      "text": "渙其群，元吉。渙有丘，匪夷所思。",
      "tokens": [
        "群",
        "丘",
        "夷",
        "所",
        "思"
      ]
    },
    {
      "text": "渙汗其大號，渙王居，无咎。",
      "tokens": [
        "汗",
        "大",
        "號",
        "王",
        "居"
      ]
    },
    {
      "text": "渙其血，去逖出，无咎。",
      "tokens": [
        "血",
        "去",
        "逖",
        "出"
      ]
    },
    {
      "text": "虞吉，有他不燕。",
      "tokens": [
        "虞",
        "他",
        "燕"
      ]
    },
    {
      "text": "鳴鶴在陰，其子和之，我有好爵，吾與爾靡之。",
      "tokens": [
        "鳴",
        "鶴",
        "在",
        "陰",
        "子",
        "和",
        "我",
        "好",
        "爵",
        "吾",
        "與",
        "爾",
        "靡"
      ]
    },
    {
      "text": "得敵，或鼓或罷，或泣或歌。",
      "tokens": [
        "得",
        "敵",
        "鼓",
        "罷",
        "泣",
        "歌"
      ]
    },
    {
      "text": "月几望，馬匹亡，无咎。",
      "tokens": [
        "月",
        "几",
        "望",
        "馬",
        "匹",
        "亡"
      ]
    },
    {
      "text": "有孚攣如，无咎。",
      "tokens": [
        "攣"
      ]
    },
    {
      "text": "翰音登于天，貞凶。",
      "tokens": [
        "翰",
        "音",
        "登",
        "天"
      ]
    },
    {
      "text": "鴻漸于干，小子厲，有言，无咎。",
      "tokens": [
        "鴻漸",
        "干",
        "小",
        "子",
        "言"
      ]
    },
    {
      "text": "鴻漸于磐，飲食衎衎，吉。",
      "tokens": [
        "鴻漸",
        "磐",
        "飲",
        "食",
        "衎",
        "衎"
      ]
    },
    {
      "text": "鴻漸于陸，夫征不復，婦孕不育，凶；利禦寇。",
      "tokens": [
        "鴻漸",
        "陸",
        "夫",
        "征",
        "復",
        "婦",
        "孕",
        "育",
        "禦",
        "寇"
      ]
    },
    {
      "text": "鴻漸于木，或得其桷，无咎。",
      "tokens": [
        "鴻漸",
        "木",
        "得",
        "桷"
      ]
    },
    {
      "text": "鴻漸于陵，婦三歲不孕，終莫之勝，吉。",
      "tokens": [
        "鴻漸",
        "陵",
        "婦",
        "歲",
        "孕",
        "終",
        "莫",
        "勝"
      ]
    },
    {
      "text": "鴻漸于陸，其羽可用為儀，吉。",
      "tokens": [
        "鴻漸",
        "陸",
        "羽",
        "儀"
      ]
    },
    {
      "text": "閑有家，悔亡。",
      "tokens": [
        "閑",
        "家"
      ]
    },
    {
      "text": "无攸遂，在中饋，貞吉。",
      "tokens": [
        "遂",
        "在",
        "中",
        "饋"
      ]
    },
    {
      "text": "家人嗃嗃，悔厲吉；婦子嘻嘻，終吝。",
      "tokens": [
        "嗃",
        "嗃",
        "婦",
        "子",
        "嘻",
        "嘻",
        "終"
      ]
    },
    {
      "text": "富家，大吉。",
      "tokens": [
        "富",
        "家"
      ]
    },
    {
      "text": "王假有家，勿恤。吉。",
      "tokens": [
        "王",
        "假",
        "家",
        "恤"
      ]
    },
    {
      "text": "有孚威如，終吉。",
      "tokens": [
        "威"
      ]
    },
    {
      "text": "進退，利武人之貞。",
      "tokens": [
        "進",
        "退",
        "武",
        "人"
      ]
    },
    {
      "text": "巽在牀下，用史巫紛若，吉无咎。",
      "tokens": [
        "在",
        "牀",
        "下",
        "史",
        "巫",
        "紛"
      ]
    },
    {
